[
  {
    "id": "1",
    "role": "Data Analyst Intern",
    "skills": ["Python", "Excel", "Data Analysis", "SQL"],
    "education": ["B.Tech CS", "B.Sc CS", "BCA", "B.Tech IT"],
    "description": "Analyze large datasets to extract meaningful insights and support data-driven decision making. Work with cross-functional teams to identify business opportunities through data visualization and statistical analysis.",
    "applicationTips": "Highlight any experience with data visualization tools like Tableau or Power BI. Include projects where you analyzed datasets and derived actionable insights. Showcase your SQL query optimization skills and statistical knowledge."
  },
  {
    "id": "2",
    "role": "Web Developer Intern",
    "skills": ["HTML", "CSS", "JavaScript", "React"],
    "education": ["B.Tech IT", "BCA", "B.Sc CS", "B.Tech CS"],
    "description": "Build and maintain responsive web applications using modern frontend technologies. Collaborate with designers and backend developers to create seamless user experiences.",
    "applicationTips": "Create a portfolio website showcasing your projects. Include live demos and GitHub repositories. Demonstrate responsive design skills and knowledge of modern web standards. Highlight any contributions to open-source projects."
  },
  {
    "id": "3",
    "role": "Frontend Developer",
    "skills": ["React", "JavaScript", "HTML", "CSS", "TypeScript"],
    "education": ["B.Tech CS", "B.Tech IT", "BCA", "B.Sc CS"],
    "description": "Develop sophisticated user interfaces using React and TypeScript. Implement state management, optimize performance, and ensure cross-browser compatibility for enterprise applications.",
    "applicationTips": "Show mastery of React hooks, context API, and state management libraries like Redux. Include performance optimization examples. Demonstrate TypeScript proficiency and component architecture design skills."
  },
  {
    "id": "4",
    "role": "Backend Developer Intern",
    "skills": ["Python", "Node.js", "SQL", "API Development"],
    "education": ["B.Tech CS", "B.Tech IT", "B.Sc CS", "MCA"],
    "description": "Design and implement server-side logic, RESTful APIs, and database structures. Ensure high performance and responsiveness to requests from frontend applications.",
    "applicationTips": "Showcase API projects with clear documentation. Highlight database design skills and query optimization. Include examples of authentication, authorization, and security implementations. Mention any experience with testing frameworks."
  },
  {
    "id": "5",
    "role": "Full Stack Developer",
    "skills": ["React", "Node.js", "MongoDB", "JavaScript", "HTML", "CSS"],
    "education": ["B.Tech CS", "B.Tech IT", "MCA", "B.Sc CS"],
    "description": "Handle both frontend and backend development tasks. Build complete web applications from database design to user interface implementation, ensuring seamless integration between all layers.",
    "applicationTips": "Present end-to-end projects demonstrating both frontend and backend skills. Show understanding of the complete software development lifecycle. Include deployment experience and CI/CD knowledge."
  },
  {
    "id": "6",
    "role": "Mobile App Developer",
    "skills": ["React Native", "JavaScript", "Mobile Development", "UI/UX"],
    "education": ["B.Tech CS", "B.Tech IT", "BCA", "B.Sc CS"],
    "description": "Create cross-platform mobile applications using React Native. Focus on delivering smooth user experiences, implementing native features, and optimizing app performance for both iOS and Android.",
    "applicationTips": "Include published apps or demo videos in your portfolio. Highlight experience with native modules, push notifications, and offline functionality. Showcase understanding of mobile design patterns and app store guidelines."
  },
  {
    "id": "7",
    "role": "Data Science Intern",
    "skills": ["Python", "Machine Learning", "Data Analysis", "Statistics"],
    "education": ["B.Tech CS", "B.Sc CS", "B.Tech IT", "M.Sc CS"],
    "description": "Apply machine learning algorithms and statistical methods to solve complex business problems. Work with large datasets, build predictive models, and communicate findings to stakeholders.",
    "applicationTips": "Include Kaggle competition participation or data science projects on GitHub. Demonstrate knowledge of scikit-learn, pandas, and NumPy. Show ability to explain complex concepts simply through visualizations and reports."
  },
  {
    "id": "8",
    "role": "Machine Learning Engineer",
    "skills": ["Python", "Machine Learning", "TensorFlow", "Deep Learning"],
    "education": ["B.Tech CS", "B.Sc CS", "M.Sc CS", "B.Tech IT"],
    "description": "Design, build, and deploy machine learning models at scale. Implement deep learning solutions using frameworks like TensorFlow and PyTorch for real-world applications.",
    "applicationTips": "Present projects with model deployment experience. Include metrics showing model performance improvements. Highlight experience with MLOps, model optimization, and production deployment. Showcase research papers or technical blog posts."
  },
  {
    "id": "9",
    "role": "UI/UX Designer Intern",
    "skills": ["Figma", "UI/UX", "HTML", "CSS", "Design"],
    "education": ["B.Des", "B.Tech CS", "BCA", "B.Sc CS"],
    "description": "Create intuitive and visually appealing user interfaces. Conduct user research, create wireframes and prototypes, and collaborate with developers to implement designs.",
    "applicationTips": "Build a strong design portfolio on Behance or Dribbble. Include case studies showing your design process from research to final implementation. Demonstrate knowledge of design systems and accessibility standards."
  },
  {
    "id": "10",
    "role": "Quality Assurance Intern",
    "skills": ["Testing", "Selenium", "Java", "API Testing"],
    "education": ["B.Tech CS", "B.Tech IT", "BCA", "B.Sc CS"],
    "description": "Ensure software quality through manual and automated testing. Create test plans, execute test cases, identify bugs, and work with developers to resolve issues.",
    "applicationTips": "Highlight experience with test automation frameworks and CI/CD integration. Include examples of test cases you've written. Demonstrate attention to detail and understanding of software testing methodologies like Agile and TDD."
  },
  {
    "id": "11",
    "role": "Business Analyst Intern",
    "skills": ["Excel", "Data Analysis", "SQL", "Communication"],
    "education": ["B.Tech", "BBA", "B.Com", "MBA"],
    "description": "Bridge the gap between business needs and technical solutions. Gather requirements, analyze business processes, and create documentation to guide development teams.",
    "applicationTips": "Showcase projects where you've translated business requirements into technical specifications. Highlight data analysis and reporting skills. Include examples of process improvement recommendations and stakeholder presentations."
  },
  {
    "id": "12",
    "role": "Digital Marketing Intern",
    "skills": ["SEO", "Social Media", "Content Writing", "Analytics"],
    "education": ["BBA", "B.Com", "BA", "MBA"],
    "description": "Execute digital marketing campaigns across various channels. Manage social media presence, optimize content for search engines, and analyze campaign performance metrics.",
    "applicationTips": "Present case studies of successful campaigns with measurable results. Show proficiency with Google Analytics, SEO tools, and social media platforms. Include content samples and demonstrate ROI from your marketing efforts."
  },
  {
    "id": "13",
    "role": "Cybersecurity Analyst",
    "skills": ["Networking", "Security", "Python", "Ethical Hacking"],
    "education": ["B.Tech CS", "B.Tech IT", "B.Sc CS", "M.Tech CS"],
    "description": "Protect organizational systems and networks from security threats. Conduct vulnerability assessments, implement security measures, and respond to security incidents.",
    "applicationTips": "Obtain certifications like CompTIA Security+, CEH, or CISSP. Include experience with penetration testing tools and security frameworks. Demonstrate knowledge of compliance standards like ISO 27001 and GDPR."
  },
  {
    "id": "14",
    "role": "DevOps Engineer Intern",
    "skills": ["Linux", "Docker", "AWS", "CI/CD"],
    "education": ["B.Tech CS", "B.Tech IT", "MCA", "B.Sc CS"],
    "description": "Automate and streamline development and deployment processes. Manage cloud infrastructure, implement CI/CD pipelines, and ensure system reliability and scalability.",
    "applicationTips": "Show hands-on experience with infrastructure as code (Terraform, CloudFormation). Include examples of CI/CD pipeline implementations. Demonstrate knowledge of monitoring tools and container orchestration with Kubernetes."
  },
  {
    "id": "15",
    "role": "Cloud Engineer",
    "skills": ["AWS", "Azure", "Cloud Computing", "Docker"],
    "education": ["B.Tech CS", "B.Tech IT", "MCA", "B.Sc CS"],
    "description": "Design and manage cloud-based infrastructure solutions. Migrate on-premise systems to cloud, optimize cloud costs, and ensure high availability and disaster recovery.",
    "applicationTips": "Earn cloud certifications from AWS, Azure, or GCP. Show cost optimization projects and infrastructure automation experience. Highlight multi-cloud architecture knowledge and cloud security best practices."
  },
  {
    "id": "16",
    "role": "Content Writer Intern",
    "skills": ["Content Writing", "SEO", "Communication", "Research"],
    "education": ["BA", "B.Com", "BBA", "MA"],
    "description": "Create engaging and SEO-optimized content for various platforms. Research topics, write articles, blog posts, and marketing copy that resonates with target audiences.",
    "applicationTips": "Build a portfolio of published articles demonstrating diverse writing styles. Show understanding of SEO principles and keyword research. Include metrics like page views and engagement rates. Demonstrate ability to meet deadlines consistently."
  },
  {
    "id": "17",
    "role": "HR Intern",
    "skills": ["Communication", "Excel", "HR Management", "Recruitment"],
    "education": ["BBA", "MBA", "BA", "B.Com"],
    "description": "Support recruitment processes, employee onboarding, and HR operations. Maintain employee records, coordinate interviews, and assist with employee engagement initiatives.",
    "applicationTips": "Highlight interpersonal skills and experience with applicant tracking systems. Include examples of successful recruitment drives or employee engagement activities. Show proficiency in HR analytics and labor law knowledge."
  },
  {
    "id": "18",
    "role": "Graphic Designer",
    "skills": ["Photoshop", "Illustrator", "Design", "Figma"],
    "education": ["B.Des", "BFA", "B.Tech CS", "Diploma"],
    "description": "Create visual content for digital and print media. Design logos, marketing materials, social media graphics, and brand identity elements that effectively communicate messages.",
    "applicationTips": "Curate a diverse portfolio showcasing different design styles and mediums. Include before/after examples and explain your creative process. Show understanding of typography, color theory, and brand guidelines."
  },
  {
    "id": "19",
    "role": "Android Developer",
    "skills": ["Java", "Kotlin", "Android", "Mobile Development"],
    "education": ["B.Tech CS", "B.Tech IT", "BCA", "MCA"],
    "description": "Develop native Android applications using Java and Kotlin. Implement Material Design principles, integrate with backend services, and optimize app performance for various Android devices.",
    "applicationTips": "Publish apps on Google Play Store or provide APK demos. Show knowledge of Android architecture components, Jetpack libraries, and modern development practices. Include performance optimization examples and crash-free rate metrics."
  },
  {
    "id": "20",
    "role": "iOS Developer",
    "skills": ["Swift", "iOS", "Mobile Development", "UI/UX"],
    "education": ["B.Tech CS", "B.Tech IT", "BCA", "MCA"],
    "description": "Build native iOS applications using Swift and SwiftUI. Create elegant user experiences following Apple's Human Interface Guidelines, integrate with iOS frameworks, and ensure smooth performance.",
    "applicationTips": "Include App Store links or TestFlight demos. Demonstrate knowledge of SwiftUI, Combine framework, and iOS design patterns. Show understanding of app lifecycle, memory management, and Apple's review guidelines."
  }
]